<?php

/* Описание скалярных переменных */

$a      = 15;        # целое
$fl     = 3.14;         # с плавающей точкой
$boo     = TRUE;         # boolean
$str    = "stroka";     # строка
$nol    = 0;
$pusto    = "";

$s1 = "Переменная a = $a \n";   # разбираемая строка
$s2 = 'Переменная a = $a \n';   # неразбираемая строка

/* Описание массива */

$mas = array( "one" => TRUE,
        1   => -20,
          "three" => 3.14);
$mas[]="two";
$mas["four"]=4;

/* Описание константы */

define("HOST", "kappa.cs.karelia.ru");

/* Вывод значения переменной на экран */
echo $a, "\n";

?>